
  #### plan-nodes-20251028T215038.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tiles-test.talos_machine_configuration_apply.control_plane["nuc-g3p-2-control"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "control_plane" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.tiles-test.talos_machine_configuration_apply.worker["nuc-g3p-2-worker"] will be created
  + resource "talos_machine_configuration_apply" "worker" {
      + apply_mode                  = "auto"
      + client_configuration        = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBajZrNG4yQVBOVklRNVJlL3VEMklnakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNREkwTWpJME1EUTFXaGNOTXpVeE1ESXlNakkwTURRMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQURkVTVVbGVMQzNFcWhtS2pVcHhtY1QvTXFLNG5Cb200TDYzCjFRbkVseDNSbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkl1VnRkaGpVSEtucitBMApzM0w5amc2eFBXR0FNQVVHQXl0bGNBTkJBQjlIbVYyaHhja0k1b29LSGN0ZUYzMGxrZmZMcHV3cUFJcjFzWHRWCnQ4NFpkMGpkalh2emdBblN5WmZMdXkwQTZPa0x1cHBQVnN3cnhuaU9YaDVSVWdRPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBeE95U0pHeTN5VHBFbmszcDJUZkVGVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNREkwTWpJME1EUTFXaGNOTWpZeE1ESTBNakkwTURRMVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFPenZEZDBaaFg4ODJ5U2k4TXp1MlNRN0dRMlNQMzRECnZPaWNDRjZubUlGWW8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVpNVcxMkdOUWNxZXY0RFN6Y3YyT0RyRTlZWUF3QlFZREsyVndBMEVBcHlzVwpsSkJIaGMvcWdQbVN5MXlCYUZzYlBPK3kvWU5uYldwQ1AyU1NKcGJUdlh2U2V2TStLczVOWTZBQ1MyUnJQZHpLCnNsbStJRlEvdFB4aGI3SGRCdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint                    = "10.0.105.52"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.105.52"
    }

  # module.tiles-test.module.talos-node["nuc-g3p-2"].module.control.proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Control - 7320 - tiles-test-cp-nuc-g3p-2 - 10.0.105.32"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiles-test-cp-nuc-g3p-2"
      + network_interface_names = (known after apply)
      + node_name               = "nuc-g3p-2"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = []
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 7320

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          + interface = "ide2"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 3000
          + floating       = 3000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "BC:24:11:D0:73:20"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.tiles-test.module.talos-node["nuc-g3p-2"].module.worker.proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Worker - 8320 - tiles-test-wk-nuc-g3p-2 - 10.0.105.52"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiles-test-wk-nuc-g3p-2"
      + network_interface_names = (known after apply)
      + node_name               = "nuc-g3p-2"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = []
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8320

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          + interface = "ide2"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 11000
          + floating       = 11000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "BC:24:11:D0:83:20"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

  ```

  </details>
  
  